In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import time

In [4]:
import os
print(os.listdir('./all'))

['items.csv', 'sample_submission.csv', 'train.csv', 'shops.csv', 'item_categories.csv', 'test.csv']

In [2]:
data = pd.read_csv("xgb_submission1.csv")

In [3]:
data.head()

   ID  item_cnt_month
0   0        1.221215
1   1        1.047138
2   2        1.233332
3   3        1.277824
4   4        1.013867

In [4]:
data['item_cnt_day'] = data.item_cnt_month

In [5]:
data.head()

   ID  item_cnt_month  item_cnt_day
0   0        1.221215      1.221215
1   1        1.047138      1.047138
2   2        1.233332      1.233332
3   3        1.277824      1.277824
4   4        1.013867      1.013867

In [6]:
data.drop('item_cnt_month', axis=1, inplace=True)

In [7]:
data.head()

   ID  item_cnt_day
0   0      1.221215
1   1      1.047138
2   2      1.233332
3   3      1.277824
4   4      1.013867

In [8]:
test = pd.read_csv('./all/test.csv')

In [9]:
test.head()

         date  date_block_num  shop_id  item_id  item_price       ID
0  06.02.2015              25       31    11208       699.0  2472142
1  21.11.2013              10       31    19525       149.0  1044690
2  03.01.2015              24       42    16169       299.0  2367559
3  18.07.2014              18       42     2737       199.0  1793501
4  13.04.2014              15        2    15229      1199.0  1585639

In [10]:
data['ID']=test.ID

In [11]:
data.head()

        ID  item_cnt_day
0  2472142      1.221215
1  1044690      1.047138
2  2367559      1.233332
3  1793501      1.277824
4  1585639      1.013867

In [13]:
data.to_csv('xgb_submission1.csv', index=False)

In [8]:
sub = pd.read_csv('./all_old/sample_submission.csv')

In [9]:
sub.item_cnt_day.value_counts()

 1.0     2132
 2.0      139
 3.0       33
 4.0       18
 5.0        4
 6.0        3
 12.0       2
-1.0        2
 24.0       1
 7.0        1
 16.0       1
 15.0       1
 9.0        1
 18.0       1
Name: item_cnt_day, dtype: int64